app/controllers/societes_controller.rb

  def index
    #    @societes = Societe.all
     @societes = Societe.paginate :page => params[:page], :order => 'nom DESC',:per_page => 5
---
SELECT * FROM "societes" ORDER BY nom DESC LIMIT 30 OFFSET 0
SELECT count(*) AS count_all FROM "societes"

  def show
    @societe = Societe.find(params[:id])
---
SELECT * FROM "societes" WHERE ("societes"."id" = 1)

  def edit
    @societe = Societe.find(params[:id])
---
SELECT * FROM "societes" WHERE ("societes"."id" = 1)

  def create
    @societe = Societe.new(params[:societe])

    respond_to do |format|
      if @societe.save
---
INSERT INTO "societes" ("ville", "nom", "updated_at", "adresse1", "alerte", "commercial", "pays", "siret", "telephone1", "code_postal", "fax", "adresse", "telephone", "commentaire", "naf", "adresseweb", "created_at") VALUES('dfgd', 'uyky', '2010-02-10 15:06:33', 'fgd', NULL, NULL, 'dfgd', NULL, 'fdg', 0, NULL, 'dfgdf', 'dfg', NULL, NULL, 'dfg', '2010-02-10 15:06:33')

  def update
    @societe = Societe.find(params[:id])

    respond_to do |format|
      if @societe.update_attributes(params[:societe])
---
SELECT * FROM "societes" WHERE ("societes"."id" = 9)
UPDATE "societes" SET "adresse1" = 'xsqxqsxqsxsqxs', "updated_at" = '2010-02-15 16:04:34' WHERE "id" = 35

  def destroy
    @societe = Societe.find(params[:id])
    @societe.destroy
---
SELECT * FROM "societes" WHERE ("societes"."id" = 1)
DELETE FROM "societes" WHERE "id" = 1